In [1]:
cols = ["*", "name", "name, salary"]
table ="Person"
where = ["salary > 25000", "salary < 25000"]
# where = [""]
order_by =["name", "salary", "name, salary"]
# order_by = [""]

In [2]:
import itertools
import json

In [3]:
tuple(itertools.product(cols, (table,)))

(('*', 'Person'), ('name', 'Person'), ('name, salary', 'Person'))

In [4]:
base_q = [f"select {cols} from {tbl} " for cols, tbl in itertools.product(cols, (table,))]
base_q

['select * from Person ',
 'select name from Person ',
 'select name, salary from Person ']

In [5]:
tuple(itertools.product(base_q, where, order_by))

(('select * from Person ', 'salary > 25000', 'name'),
 ('select * from Person ', 'salary > 25000', 'salary'),
 ('select * from Person ', 'salary > 25000', 'name, salary'),
 ('select * from Person ', 'salary < 25000', 'name'),
 ('select * from Person ', 'salary < 25000', 'salary'),
 ('select * from Person ', 'salary < 25000', 'name, salary'),
 ('select name from Person ', 'salary > 25000', 'name'),
 ('select name from Person ', 'salary > 25000', 'salary'),
 ('select name from Person ', 'salary > 25000', 'name, salary'),
 ('select name from Person ', 'salary < 25000', 'name'),
 ('select name from Person ', 'salary < 25000', 'salary'),
 ('select name from Person ', 'salary < 25000', 'name, salary'),
 ('select name, salary from Person ', 'salary > 25000', 'name'),
 ('select name, salary from Person ', 'salary > 25000', 'salary'),
 ('select name, salary from Person ', 'salary > 25000', 'name, salary'),
 ('select name, salary from Person ', 'salary < 25000', 'name'),
 ('select name, salary from Person ', 'salary < 25000', 'salary'),
 ('select name, salary from Person ', 'salary < 25000', 'name, salary'))

In [6]:
q = []
for base_res, where_res, order_res in itertools.product(base_q, where, order_by):
    q.extend([f"{base_res} {f'where {where_res}' if where_res else ''} {f'order by {order_res} {order_type}' if order_res else ''};" for order_type in ("asc", "desc") ])
q = tuple(set(q))
len(q), q

(36,
 ('select * from Person  where salary < 25000 order by name asc;',
  'select name, salary from Person  where salary < 25000 order by salary asc;',
  'select name from Person  where salary < 25000 order by name asc;',
  'select * from Person  where salary < 25000 order by name, salary asc;',
  'select * from Person  where salary > 25000 order by salary asc;',
  'select name from Person  where salary < 25000 order by salary asc;',
  'select * from Person  where salary > 25000 order by name, salary asc;',
  'select name from Person  where salary > 25000 order by name, salary desc;',
  'select name from Person  where salary < 25000 order by name, salary asc;',
  'select name, salary from Person  where salary > 25000 order by name desc;',
  'select name, salary from Person  where salary > 25000 order by salary asc;',
  'select name, salary from Person  where salary < 25000 order by name, salary desc;',
  'select name, salary from Person  where salary < 25000 order by name asc;',
  'select name from Person  where salary > 25000 order by name asc;',
  'select name from Person  where salary < 25000 order by name, salary desc;',
  'select name from Person  where salary > 25000 order by name, salary asc;',
  'select * from Person  where salary > 25000 order by name, salary desc;',
  'select name, salary from Person  where salary > 25000 order by name asc;',
  'select name from Person  where salary > 25000 order by salary asc;',
  'select * from Person  where salary > 25000 order by name desc;',
  'select name, salary from Person  where salary < 25000 order by name, salary asc;',
  'select * from Person  where salary < 25000 order by name desc;',
  'select name, salary from Person  where salary > 25000 order by name, salary desc;',
  'select * from Person  where salary < 25000 order by name, salary desc;',
  'select name, salary from Person  where salary > 25000 order by salary desc;',
  'select name from Person  where salary > 25000 order by salary desc;',
  'select name, salary from Person  where salary < 25000 order by name desc;',
  'select * from Person  where salary < 25000 order by salary desc;',
  'select * from Person  where salary > 25000 order by name asc;',
  'select * from Person  where salary > 25000 order by salary desc;',
  'select name from Person  where salary < 25000 order by salary desc;',
  'select name from Person  where salary > 25000 order by name desc;',
  'select * from Person  where salary < 25000 order by salary asc;',
  'select name from Person  where salary < 25000 order by name desc;',
  'select name, salary from Person  where salary < 25000 order by salary desc;',
  'select name, salary from Person  where salary > 25000 order by name, salary asc;'))